In [ ]:
import pandas as pd

df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

df

print(df["Age"])
print(df["Name"])
print(df["Sex"])

print(type(df["Age"]))
print(type(df))

# 정리
# Series : 1차원 데이터(열 하나)
# DataFrame : 2차원 데이터(열 여러 개가 모인 표 형태)

0    22
1    35
2    58
Name: Age, dtype: int64
0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object
0      male
1      male
2    female
Name: Sex, dtype: object
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [ ]:
ages = pd.Series([22, 35, 58,], name="Age")
# pd.Series : 1차원 배열처럼 생긴 자료구조
print(ages)

df["Age"]

print("최대 나이 : ", df["Age"].max()) # 최대값
print("최대 나이 : ", df["Age"].mean()) # 평균값

df.describe()
# describe() : 수치형 데이터에 대한 기초 통계 정보를 요약해서 보여줌.
# count : 데이터 개수
# mean : 평균
# std : 표준편차(데이터의 흩어짐 정도)
# min : 최소값
# 25%, 50%, 75% : 분위수(중앙값 포함)
# max : 최대값

df.info()
# info() : 전체 데이터 프레임의 요약 정보를 보여줌

0    22
1    35
2    58
Name: Age, dtype: int64
최대 나이 :  58
최대 나이 :  38.333333333333336
describe() :수치형 데이터에 대한 기초 통계 정보를 요약해서 보여줌.
info() : 전체 데이터 프레임의 요약 정보를 보여줌
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Sex     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [ ]:
# loc[] : 라벨 기반(이름 기반) 접근
# iloc[] : 인덱스 번호 기반 접근

# 첫 번째 행을 출력
print(df.iloc[0])

# 두 번째 행을 출력
print(df.iloc[1])

# loc는 이름 기반인데, 여기서는 인덱스가 0,1,2라서 거의 비슷하게 동작
print(df.loc[0])

Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: 0, dtype: object
Name    Allen, Mr. William Henry
Age                           35
Sex                         male
Name: 1, dtype: object
Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: 0, dtype: object

In [32]:
# head(), tail() : 처음 몇 개 or 마지막 몇 개만 보기

# 처음 5개만 출력
print(df.head())

# 처음 2개만 출력
print(df.head(2))

# 마지막 2개만 출력
print(df.tail(2))

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
                       Name  Age   Sex
0   Braund, Mr. Owen Harris   22  male
1  Allen, Mr. William Henry   35  male
                       Name  Age     Sex
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [ ]:
# 조건 필터링(Boolean Indexing)

# 나이가 30 이상인 사람만 보기
print(df[df["Age"] >= 30])

# 성별이 여성(female)인 행만 보기
print(df[df["Sex"] == "female"])

                       Name  Age     Sex
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
                       Name  Age     Sex
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [36]:
# 새로운 열 추가

df["Suvived"] = [1, 0, 1]
df

                       Name  Age     Sex  Suvived
0   Braund, Mr. Owen Harris   22    male        1
1  Allen, Mr. William Henry   35    male        0
2  Bonnell, Miss. Elizabeth   58  female        1

In [37]:
# 열 이름 바꾸기

df = df.rename(columns={"Sex" : "Gender"})

df

                       Name  Age  Gender  Suvived
0   Braund, Mr. Owen Harris   22    male        1
1  Allen, Mr. William Henry   35    male        0
2  Bonnell, Miss. Elizabeth   58  female        1

In [38]:
# 열 삭제하기

# Suvived 열 삭제 (axis=1 열, axis=0 행)
df = df.drop("Suvived", axis=1)
df

                       Name  Age  Gender
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [ ]:
# 결측치(NaN) 처리
# 빠진 데이터

df.isnull() # 결측치 있는지 확인(True/False)

df2 = df.copy() # df있는 데이터 복제
df2.loc[1, "Age"] = None
df2.isnull()

df2.dropna(axis=0) # 결측치가 있는 행 삭제
df2.fillna(0) # 결측치 대신 다른 값으로 채우기

df2["Age"].fillna(df["Age"].mean()) # 평균으로 채우기
df2.fillna(method="ffill") # 이전 값으로 채움
df2.fillna(method="bfill") # 다음 값으로 채움

C:\Users\admin\AppData\Local\Temp\ipykernel_15732\3366516359.py:14: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2.fillna(method="ffill") # 이전 값으로 채움
C:\Users\admin\AppData\Local\Temp\ipykernel_15732\3366516359.py:15: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2.fillna(method="bfill") # 다음 값으로 채움

                       Name   Age  Gender
0   Braund, Mr. Owen Harris  22.0    male
1  Allen, Mr. William Henry  58.0    male
2  Bonnell, Miss. Elizabeth  58.0  female